/*
Copyright 2025 vnz

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 2 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

#include "vnz.h"

enum layer_names { _BASE, _LOWER, _RAISE, _ADJUST };

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

/* Base
 * ,-----------------------------------------------------------------------------------.------.------.
 * |   `  |   1  |   2  |   3  |   4  |   5  |   [  |   ]  |   6  |   7  |   8  |   9  |   0  |   -  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * | Tab  |   q  |   w  |   e  |   r  |   t  |   {  |   }  |   y  |   u  |   i  |   o  |   p  | Bksp |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * | Esc  |   a  |   s  |   d  |   f  |   g  |   (  |   )  |   h  |   j  |   k  |   l  |   ;  |   '  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * | Ctrl |   z  |   x  |   c  |   v  |   b  | Home | End  |   n  |   m  |   ,  |   .  |   /  |Enter |
 * `------+------+------+------+------+------+------+------+------+------+------+------+------+------'
 *                      | GUI  | Alt  | Spc  |Lower |Raise | Spc  |  ↓   |  ↑   |
 *                      `------------------------------------------------------'
 */
[_BASE] = LAYOUT(
    KC_GRV,  KC_1,    KC_2,    KC_3,    KC_4,    KC_5,    KC_LBRC, KC_RBRC, KC_6,    KC_7,    KC_8,    KC_9,    KC_0,    KC_MINS,
    KC_TAB,  KC_Q,    KC_W,    KC_E,    KC_R,    KC_T,    KC_LCBR, KC_RCBR, KC_Y,    KC_U,    KC_I,    KC_O,    KC_P,    KC_BSPC,
    KC_ESC,  KC_A,    KC_S,    KC_D,    KC_F,    KC_G,    KC_LPRN, KC_RPRN, KC_H,    KC_J,    KC_K,    KC_L,    KC_SCLN, KC_QUOT,
    KC_LCTL, KC_Z,    KC_X,    KC_C,    KC_V,    KC_B,    KC_HOME, KC_END,  KC_N,    KC_M,    KC_COMM, KC_DOT,  KC_SLSH, KC_ENT,
                               KC_LGUI, KC_LALT, KC_SPC,  TL_LOWR, TL_UPPR, KC_SPC,  KC_DOWN, KC_UP
),

/* Lower (Better-Shift: shifted alphanumerics)
 * ,-----------------------------------------------------------------------------------.------.------.
 * |   ~  |   !  |   @  |   #  |   $  |   %  |      |      |   ^  |   &  |   *  |   (  |   )  |   _  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * | Apps |   Q  |   W  |   E  |   R  |   T  |      |      |   Y  |   U  |   I  |   O  |   P  | Del  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * |PrtScr|   A  |   S  |   D  |   F  |   G  |      |      |   H  |   J  |   K  |   L  |   :  |   "  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |   Z  |   X  |   C  |   V  |   B  | PgUp | PgDn |   N  |   M  |   <  |   >  |   ?  |AltEnt|
 * `------+------+------+------+------+------+------+------+------+------+------+------+------+------'
 *                      |      |      |      |      |      |      | TabL | TabR |
 *                      `------------------------------------------------------'
 */
[_LOWER] = LAYOUT(
    KC_TILD, KC_EXLM, KC_AT,   KC_HASH, KC_DLR,  KC_PERC, _______, _______, KC_CIRC, KC_AMPR, KC_ASTR, KC_LPRN, KC_RPRN, KC_UNDS,
    LX_APPS, S(KC_Q), S(KC_W), S(KC_E), S(KC_R), S(KC_T), _______, _______, S(KC_Y), S(KC_U), S(KC_I), S(KC_O), S(KC_P), KC_DEL,
    KC_PSCR, S(KC_A), S(KC_S), S(KC_D), S(KC_F), S(KC_G), _______, _______, S(KC_H), S(KC_J), S(KC_K), S(KC_L), KC_COLN, KC_DQUO,
    _______, S(KC_Z), S(KC_X), S(KC_C), S(KC_V), S(KC_B), KC_PGUP, KC_PGDN, S(KC_N), S(KC_M), KC_LABK, KC_RABK, KC_QUES, ALTENT,
                               _______, _______, _______, _______, _______, _______, ST_TBLT, ST_TBRT
),

/* Raise (French accents - positioned on base letter)
 * ,-----------------------------------------------------------------------------------.------.------.
 * |      |  F1  |  F2  |  F3  |  F4  |  F5  | F11  | F12  |  F6  |  F7  |  F8  |  F9  | F10  |   +  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |   â  |   ê  |   é  |      |      |      |      |      |   ù  |   î  |   ô  |   œ  | Del  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |   à  |   ë  |   è  |      |      |      |      |      |      |   ï  |   û  |   ü  |   €  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |      |      |   ç  |      |      |      |      |      |      |      |      |      |      |
 * `------+------+------+------+------+------+------+------+------+------+------+------+------+------'
 *                      |      |      |      |      |      |      |  ←   |  →   |
 *                      `------------------------------------------------------'
 */
[_RAISE] = LAYOUT(
    _______, KC_F1,   KC_F2,   KC_F3,   KC_F4,   KC_F5,   KC_F11,  KC_F12,  KC_F6,   KC_F7,   KC_F8,   KC_F9,   KC_F10,  KC_PLUS,
    _______, FR_AA2,  FR_EA3,  FR_EA1,  _______, _______, _______, _______, _______, FR_UA2,  FR_IA1,  FR_OA1,  FR_OA2,  KC_DEL,
    _______, FR_AA1,  FR_EA4,  FR_EA2,  _______, _______, _______, _______, _______, _______, FR_IA2,  FR_UA1,  FR_UA3,  EURO,
    _______, _______, _______, FR_CA1,  _______, _______, _______, _______, _______, _______, _______, _______, _______, _______,
                               _______, _______, _______, _______, _______, _______, KC_LEFT, KC_RGHT
),

/* Adjust (Lower + Raise = Uppercase French accents + system)
 * ,-----------------------------------------------------------------------------------.------.------.
 * |      |      |      |      |      |      |      |      |      |      |      |      |      |   =  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |   Â  |   Ê  |   É  |      |      |      |      |      |   Ù  |   Î  |   Ô  |   Œ  | Ins  |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * | Boot |   À  |   Ë  |   È  |      |      |      |      |      |      |   Ï  |   Û  |   Ü  |      |
 * |------+------+------+------+------+------+------+------+------+------+------+------+------+------|
 * |      |      |      |   Ç  |UC_MAC|UC_WIN| NKRO |UC_LNX|      |      |      |      |   \  |      |
 * `------+------+------+------+------+------+------+------+------+------+------+------+------+------'
 *                      |      |      |      |      |      |      |      |      |
 *                      `------------------------------------------------------'
 */
[_ADJUST] = LAYOUT(
    _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, KC_EQL,
    _______, FR_AM2,  FR_EM3,  FR_EM1,  _______, _______, _______, _______, _______, FR_UM2,  FR_IM1,  FR_OM1,  FR_OM2,  KC_INS,
    QK_BOOT, FR_AM1,  FR_EM4,  FR_EM2,  _______, _______, _______, _______, _______, _______, FR_IM2,  FR_UM1,  FR_UM3,  _______,
    _______, _______, _______, FR_CM1,  UC_MAC,  UC_WINC, NK_TOGG, UC_LINX, _______, _______, _______, _______, KC_BSLS, _______,
                               _______, _______, _______, _______, _______, _______, _______, _______
)
};
